package com.test.java;

public class Ex02_DataType {
	
	public static void main(String[] args) {
		// Ctrl + Space > 가이드 역할, 오타 방지 
		
			/*
		
				자바의 자료형, Data Type
				- 데이터(자료)의 형태 
				- 데이터의 길이(범위)와 생김새를 미리 정의하고, 그 정의에 따라 분류해놓은 규칙 
				
				
				초등학교
				- 100, 200, 300 > 정수 
				- 4.14, 5.21, 5.62 > 실수
				- 홍길동, 아무개, 자바 > 문자
				
				자바의 자료형의 구분 기준 (두 가지)
				1. 형태
				2. 길이
				
				자료형 
				1. 기본형 = 원시형(Primitive), 값형(Value Type)
					A. 숫자형 (6종류)
						1. 정수형 (메모리 크기에 따른 분류) [ 41p 참조 ]
							a. byte > 1
							b. short > 2
							c. int > 4
							d. long > 8
							
						2. 실수형 ( 길이보다 정밀도로 구분 ) [ 47p 참조 ]
							a. float > 4 > 32bit	
								- 1bit > 부호
								- 8bit > 지수 > 10^256
								- 23bit > 가수 
								- 단정도형 (정밀도) 
							b. double > 8 > 64bit 
								- 1bit > 부호
								- 11bit > 지수 > 10^2048
								- 52bit > 가수
								- 배정도형 (float 보다 약 2배 넓음)
							
					B. 문자형 [ 45p 참조 ]
						1. 문자형
							a. char > 2byte(16bit) 
							- 0~ 65535 (음수 필요 x ) (경우의 수) 
					C. 논리형 [ 50p 참조 ]
						1. 논리형 > 1
							a. boolean
							- 참(true), 거짓(false) 
							
					
				2. 참조형(Reference Type) - 클래스 수업에 배움 (마음대로 추가 정의할 수 있는 타입)
				
				
				
				
				16GB (*1024)
				16,384MG
				16,777,216KB
				17,179,869,184B
				
				B(byte) > 프로그래밍에서 데이터를 저장하는 기본 단위 (바이트 하나 당 데이터 하나 저장 가능)
				bit > 물리적으로 데이터를 저장하는 기본 단위 (1 또는 0을 저장 - 한 칸 == bit )(2진수 저장 공간) 
				
				1B == 8bit
				137,438,953,472bit 
				
				
				 
				
			*/
		
	}
}
